"""Содержит текстовые сообщения бота"""

MENU_NOTE = "\nНе штрыкать! Нажал, дождись ответа."
AUTHOR = "Михаил Семёнов \n"
ACCESS_DENIED = "<strong>В доступе отказано! </strong> 🛑\n"
SMILES = {
    "SIG": r"¯\_(ツ)_/¯",
    "BEAR": r"ʕ•ᴥ•ʔ",
    "CAT": r"(ᵔᴥᵔ)"
}

BEHAPPY = "Всё будет хорошо.\n"

HELP_MSG = "*Бот приветсвует тебя.*\n" \
           "Бот позволяет искать людей в социальной сети ВКонтакте, подходящих под условия, на основании информации " \
           "о пользователе из VK:\n" \
           "- возраст (если указан +/- 2 года от Вашего возраста);\n" \
           "- пол (если указан);\n" \
           "- город (если указан);\n" \
           "- семейное положение (если указано);\n" \
           "- фото (не менее 3-х фотографий).\n"

SRCH_CMPLT_MSG = f"**Поиск закончен!**\n\n Приступаю к показу анкет."
LOOK_CMPLT_MSG = "Просмотр анкет окончен.\n **Досвидания!**"
LOOK_CMPLT_REP_MSG = "Просмотр анкет окончен.\n **Повторить?**"
DUNDSTD_MSG = "Не понял вашего ответа.\nПожалуйста, нажмите Да или Нет..."
SRCHING_MSG = "Собираю информацию..."
PRS_YES_MSG =  "Нажмите **Да** для продолжения."
GET_SRCH_MSG = "Начать поиск анкет?"